app/controllers/cities_controller.rb

  def index
    @cities = City.all.page(params[:page]).per(5)
---
SELECT "cities".* FROM "cities"
SELECT COUNT(*) FROM "cities"

  def create
    @city = City.new(city_params)
    @city.save
---
INSERT INTO "cities" ("name", "short_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "London"], ["short_name", "Ld"], ["created_at", "2015-02-27 11:12:14.188523"], ["updated_at", "2015-02-27 11:12:14.188523"]]

  def update
    @city.update(city_params)
---
UPDATE "cities" SET "name" = ?, "short_name" = ?, "updated_at" = ? WHERE "cities"."id" = ?  [["name", "Paris"], ["short_name", "Pr"], ["updated_at", "2015-02-27 14:02:45.282955"], ["id", 3]]

  def destroy
    User.where(city_id: @city).each do |u|
      u.city_id = nil
      u.save
    end

    @city.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."city_id" = ? LIMIT 1  [["city_id", 5]]
DELETE FROM "cities" WHERE "cities"."id" = ?  [["id", 2]]

  def set_city
    @city = City.find(params[:id])
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 2]]